TestCases/BubbleShrink/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0       0       -0.015)
    (0.4     0       -0.015)
    (0.4     0.4     -0.015)
    (0       0.4     -0.015)
    (0       0       0.015)
    (0.4     0       0.015)
    (0.4     0.4     0.015)
    (0       0.4     0.015)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 25 1) simpleGrading (1 1 1)
);


edges
(
);

boundary
(

    Walls
    {
        type    wall;
        faces
        (
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    
    Top
    {
        type    patch;
        faces
        (
            (3 7 6 2)
        );
    }
    
    FrontAndBack
    {
        type    empty;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
