TestCases/BubbleShrink/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    s1;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
	    {
       	    patch     "Walls";
    	}
    }

    {
        name    s1;
        type    faceSet;
        action  subset;
        source  cylinderToFace;        
        sourceInfo
	    {

//       set s1;
       	    p1       (0.2 -0.001  0);     // start point on cylinder axis
       	    p2       (0.2  0.001  0);     // end point on cylinder axis
       	    radius   0.02;
    	}
    }

);

// ************************************************************************* //
